$(document).ready(function() {
	GeoPortal.config = GeoPortal.config || {};
	GeoPortal.config.regions = [
		{
			"id": 0,
			"name": "Россия",
			"bbox": "13.7109375 44.08758502824516,148.7109375 64.47279382008166"
		},
		{
			"id": 1,
			"name": "Алтайский край",
			"bbox": "77.889121 50.640312,87.16865 54.45311"
		},
		{
			"id": 2,
			"name": "Амурская область",
			"bbox": "119.655391 48.853458,134.920527 57.060508"
		},
		{
			"id": 3,
			"name": "Архангельская область",
			"bbox": "35.269598 60.635816,69.957225 82.058623"
		},
		{
			"id": 4,
			"name": "Астраханская область",
			"bbox": "44.960978 45.262264,49.886117 48.863565"
		},
		{
			"id": 5,
			"name": "Башкортостан",
			"bbox": "53.157542 51.569554,60.001809 56.534608"
		},
		{
			"id": 6,
			"name": "Белгородская область",
			"bbox": "35.325686 49.796014,39.280769 51.429731"
		},
		{
			"id": 7,
			"name": "Брянская область",
			"bbox": "31.241908 51.843075,35.325127 54.034031"
		},
		{
			"id": 8,
			"name": "Владимирская область",
			"bbox": "38.268103 55.10142,42.976134 56.812682"
		},
		{
			"id": 9,
			"name": "Волгоградская область",
			"bbox": "41.168105 47.443765,47.431637 51.247608"
		},
		{
			"id": 10,
			"name": "Вологодская область",
			"bbox": "34.719093 58.477315,47.152878 61.614232"
		},
		{
			"id": 11,
			"name": "Воронежская область",
			"bbox": "38.137752 49.55795,42.947337 52.103046"
		},
		{
			"id": 12,
			"name": "Еврейская автономная область",
			"bbox": "130.520272 47.656518,134.995785 49.493851"
		},
		{
			"id": 13,
			"name": "Забайкальский край",
			"bbox": "107.734213 49.1542,122.14582 58.437393"
		},
		{
			"id": 14,
			"name": "Ивановская область",
			"bbox": "39.374037 56.352363,43.324612 57.740128"
		},
		{
			"id": 15,
			"name": "Ингушетия",
			"bbox": "44.478436 42.615748,45.195499 43.614089"
		},
		{
			"id": 16,
			"name": "Иркутская область",
			"bbox": "95.646271 51.130339,119.138674 64.321545"
		},
		{
			"id": 17,
			"name": "Кабардино-Балкария",
			"bbox": "42.397268 42.889536,44.475368 44.020314"
		},
		{
			"id": 18,
			"name": "Калининградская область",
			"bbox": "19.402577 54.318215,22.886659 55.384"
		},
		{
			"id": 19,
			"name": "Калужская область",
			"bbox": "33.441422 53.276999,37.27543 55.35128"
		},
		{
			"id": 20,
			"name": "Камчатский край",
			"bbox": "155.215243 50.686734,174.518872 64.937469"
		},
		{
			"id": 21,
			"name": "Карачаево-Черкесия",
			"bbox": "40.67518 43.186823,42.681373 44.497637"
		},
		{
			"id": 22,
			"name": "Кемеровская область",
			"bbox": "84.447895 52.163467,89.402644 56.83442"
		},
		{
			"id": 23,
			"name": "Кировская область",
			"bbox": "46.263784 56.060762,53.930011 61.067393"
		},
		{
			"id": 24,
			"name": "Костромская область",
			"bbox": "40.390103 57.272169,47.639515 59.623604"
		},
		{
			"id": 25,
			"name": "Краснодарский край",
			"bbox": "36.530486 43.224431,41.74398 47.003021"
		},
		{
			"id": 26,
			"name": "Красноярский край",
			"bbox": "74.986851 51.772257,114.739629 81.474181"
		},
		{
			"id": 27,
			"name": "Курганская область",
			"bbox": "61.966185 54.187323,68.722363 56.842297"
		},
		{
			"id": 28,
			"name": "Курская область",
			"bbox": "34.080222 50.901557,38.51927 52.44506"
		},
		{
			"id": 29,
			"name": "Ленинградская область",
			"bbox": "26.440169 58.417336,35.701312 61.329293",
			"coupledId": 62
		},
		{
			"id": 30,
			"name": "Липецкая область",
			"bbox": "37.721716 51.887062,40.764775 53.586654"
		},
		{
			"id": 31,
			"name": "Магаданская область",
			"bbox": "144.728624 58.637529,163.495694 66.339138"
		},
		{
			"id": 32,
			"name": "Марий Эл",
			"bbox": "45.62374 55.829454,50.202985 57.342865"
		},
		{
			"id": 33,
			"name": "Мордовия",
			"bbox": "42.164255 53.643167,46.729568 55.190268"
		},
		{
			"id": 34,
			"name": "Москва",
			"bbox": "36.803101 55.142522,37.967428 56.021224"
		},
		{
			"id": 35,
			"name": "Московская область",
			"bbox": "35.148495 54.255696,40.205688 56.958512",
			"coupledId": 34
		},
		{
			"id": 36,
			"name": "Мурманская область",
			"bbox": "28.415778 65.691813,42.505704 70.152975"
		},
		{
			"id": 37,
			"name": "Ненецкий автономный округ",
			"bbox": "41.312596 65.820969,65.670533 70.730399"
		},
		{
			"id": 38,
			"name": "Нижегородская область",
			"bbox": "41.776477 54.462103,47.771652 58.091176"
		},
		{
			"id": 39,
			"name": "Новгородская область",
			"bbox": "29.618726 56.909066,36.228919 59.432763"
		},
		{
			"id": 40,
			"name": "Новосибирская область",
			"bbox": "75.08801 53.29141,85.115957 57.237834"
		},
		{
			"id": 41,
			"name": "Омская область",
			"bbox": "70.358304 53.435395,76.303592 58.575719"
		},
		{
			"id": 42,
			"name": "Оренбургская область",
			"bbox": "50.768163 50.495313,61.689785 54.365639"
		},
		{
			"id": 43,
			"name": "Орловская область",
			"bbox": "34.791971 51.934992,38.067213 53.652394"
		},
		{
			"id": 44,
			"name": "Пензенская область",
			"bbox": "42.081739 52.291266,46.981365 54.03078"
		},
		{
			"id": 45,
			"name": "Пермский край",
			"bbox": "51.771517 56.105243,59.482731 61.663067"
		},
		{
			"id": 46,
			"name": "Приморский край",
			"bbox": "130.39465 42.170636,139.309393 48.464346"
		},
		{
			"id": 47,
			"name": "Псковская область",
			"bbox": "27.317441 55.588303,31.51786 59.021159"
		},
		{
			"id": 48,
			"name": "Республика Адыгея",
			"bbox": "38.684018 43.760479,40.777647 45.217113"
		},
		{
			"id": 49,
			"name": "Республика Алтай",
			"bbox": "83.932803 49.069536,89.865649 52.660268"
		},
		{
			"id": 50,
			"name": "Республика Бурятия",
			"bbox": "98.629918 49.970156,116.92173 57.24988"
		},
		{
			"id": 51,
			"name": "Республика Дагестан",
			"bbox": "45.103421 41.185097,48.814096 44.991721"
		},
		{
			"id": 52,
			"name": "Республика Калмыкия",
			"bbox": "41.634308 44.718891,47.826803 48.270856"
		},
		{
			"id": 53,
			"name": "Республика Карелия",
			"bbox": "29.305928 60.679568,37.946638 66.667324"
		},
		{
			"id": 54,
			"name": "Республика Коми",
			"bbox": "45.39935 59.198289,66.251686 68.422662"
		},
		{
			"id": 55,
			"name": "Республика Крым",
			"bbox": "32.201579 44.184598,36.681568 46.22958",
			"coupledId": 66
		},
		{
			"id": 56,
			"name": "Республика Саха (Якутия)",
			"bbox": "105.508341 55.487671,163.105983 77.310229"
		},
		{
			"id": 57,
			"name": "Республика Тыва",
			"bbox": "88.791531 49.74293,99.273702 53.72893"
		},
		{
			"id": 58,
			"name": "Республика Хакасия",
			"bbox": "87.882589 51.285126,91.924731 55.437878"
		},
		{
			"id": 59,
			"name": "Ростовская область",
			"bbox": "38.220892 45.951688,44.324152 50.214477"
		},
		{
			"id": 60,
			"name": "Рязанская область",
			"bbox": "38.665982 53.30907,42.692094 55.366494"
		},
		{
			"id": 61,
			"name": "Самарская область",
			"bbox": "47.930441 51.773037,52.568276 54.677156"
		},
		{
			"id": 62,
			"name": "Санкт-Петербург",
			"bbox": "29.42981 59.633783,30.758934 60.244837"
		},
		{
			"id": 63,
			"name": "Саратовская область",
			"bbox": "42.503671 49.801213,50.83258 52.819371"
		},
		{
			"id": 64,
			"name": "Сахалинская область",
			"bbox": "140.922056 43.177563,156.831768 54.625981"
		},
		{
			"id": 65,
			"name": "Свердловская область",
			"bbox": "57.229384 56.053224,66.184857 61.946615"
		},
		{
			"id": 66,
			"name": "Севастополь",
			"bbox": "33.0912 44.19104,33.926203 44.94052"
		},
		{
			"id": 67,
			"name": "Северная Осетия — Алания",
			"bbox": "43.398487 42.546937,44.960431 43.835116"
		},
		{
			"id": 68,
			"name": "Смоленская область",
			"bbox": "30.75157 53.408691,35.395003 56.067054"
		},
		{
			"id": 69,
			"name": "Ставропольский край",
			"bbox": "40.846043 43.658578,45.715953 46.236222"
		},
		{
			"id": 70,
			"name": "Тамбовская область",
			"bbox": "39.915694 51.588084,43.248087 53.822577"
		},
		{
			"id": 71,
			"name": "Татарстан",
			"bbox": "47.237019 53.974244,54.265697 56.678167"
		},
		{
			"id": 72,
			"name": "Тверская область",
			"bbox": "30.728387 55.632035,38.32641 58.863139"
		},
		{
			"id": 73,
			"name": "Томская область",
			"bbox": "75.056664 55.605838,89.379033 61.035672"
		},
		{
			"id": 74,
			"name": "Тульская область",
			"bbox": "35.898555 52.946357,38.951545 54.851836"
		},
		{
			"id": 75,
			"name": "Тюменская область",
			"bbox": "64.827192 55.146373,75.199295 59.989559"
		},
		{
			"id": 76,
			"name": "Удмуртия",
			"bbox": "51.124165 55.850578,54.436131 58.545842"
		},
		{
			"id": 77,
			"name": "Ульяновская область",
			"bbox": "45.796719 52.532669,50.243401 54.891446"
		},
		{
			"id": 78,
			"name": "Хабаровский край",
			"bbox": "130.386742 46.634961,147.21678 62.531746"
		},
		{
			"id": 79,
			"name": "Ханты-Мансийский автономный округ — Югра",
			"bbox": "59.203794 58.579853,85.976673 65.717736"
		},
		{
			"id": 80,
			"name": "Челябинская область",
			"bbox": "57.131288 51.990883,63.352015 56.365798"
		},
		{
			"id": 81,
			"name": "Чеченская Республика",
			"bbox": "44.833205 42.475767,46.662041 44.008576"
		},
		{
			"id": 82,
			"name": "Чувашия",
			"bbox": "45.911255 54.627395,48.420602 56.328518"
		},
		{
			"id": 83,
			"name": "Чукотский автономный округ",
			"bbox": "-180 62.554558,-174.939411 71.805019"
		},
		{
			"id": 84,
			"name": "Ямало-Ненецкий автономный округ",
			"bbox": "62.000444 62.195657,86.007285 73.721756"
		},
		{
			"id": 85,
			"name": "Ярославская область",
			"bbox": "37.327909 56.534344,41.193498 58.956012"
		}
	]
});